Revit 2024 API
CurveArrArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CurveArrArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As CurveArrArrayIterator
Visual C++
public:
virtual CurveArrArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
CurveArrArray Class
Autodesk.Revit.DB Namespace